In [ ]:
# Updating Rows and Columns means

In [9]:
people = {
    "first": ["tina", 'Jane', 'John'], 
    "last": ["singh", 'Doe', 'Doe'], 
    "email": ["tinasingh@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [10]:
import pandas as pd

In [11]:
df  = pd.DataFrame(people)

In [12]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [13]:
df.columns = ['first_name', 'last_name', 'email']
df

  first_name last_name                email
0       tina     singh  tinasingh@gmail.com
1       Jane       Doe    JaneDoe@email.com
2       John       Doe    JohnDoe@email.com

In [14]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                email
0       tina     singh  tinasingh@gmail.com
1       Jane       Doe    JaneDoe@email.com
2       John       Doe    JohnDoe@email.com

In [15]:
# rename column name using rename() function
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)
df

  first   last                email
0  tina  singh  tinasingh@gmail.com
1  Jane    Doe    JaneDoe@email.com
2  John    Doe    JohnDoe@email.com

In [16]:
#update row 2 values
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']
df

  first   last                email
0  tina  singh  tinasingh@gmail.com
1  Jane    Doe    JaneDoe@email.com
2  John  Smith  JohnSmith@email.com

In [17]:
#update last name and email for row 2
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']
df

  first   last                email
0  tina  singh  tinasingh@gmail.com
1  Jane    Doe    JaneDoe@email.com
2  John  Smith  JohnSmith@email.com

In [19]:
df.loc[1, 'last'] = 'sharma'
df

  first    last                email
0  tina   singh  tinasingh@gmail.com
1  Jane  sharma    JaneDoe@email.com
2  John   Smith  JohnSmith@email.com

In [21]:
#using .at
df.at[1, 'last'] = 'rajpoot'
df

  first     last                email
0  tina    singh  tinasingh@gmail.com
1  Jane  rajpoot    JaneDoe@email.com
2  John    Smith  JohnSmith@email.com